<?php
/*******************************************************************************
カテゴリ対応
	バックオフィス

商品の並び替え：メインコントローラー

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
session_start();
if( !$_SESSION['LOGIN'] ){
	header("Location: ../err.php");exit();
}
if(!$_SERVER['PHP_AUTH_USER']||!$_SERVER['PHP_AUTH_PW']){
//	header("HTTP/1.0 404 Not Found");exit();
}

// 設定ファイル＆共通ライブラリの読み込み
require_once("../../common/INI_config.php");		// 共通設定情報
require_once("../../common/INI_ShopConfig.php");	// ショップ用設定情報

#===============================================================================
# $_POST['status']の内容により処理を分岐
#===============================================================================
switch($_POST['status']):
case "view_order_update":
//////////////////////////////////////////////////////////////////////
// 新しく並び変えた順番に更新する

	include("LGC_update_view_order.php");

case "search_result":
//////////////////////////////////////////////////////////////////////
// 現在の表示順に商品リストを表示

	include("LGC_getDB-data.php");
	include("DISP_listview.php");

	break;
default:
	//////////////////////////////////////////////////////////////////////
	// カテゴリ指定画面を表示

	include("Disp_input.php");
	break;
endswitch;

// デバッグ用
/*
print_r($_POST);
echo "<hr>";
print_r($_SESSION);
*/
?>
