<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('P1_TITLE','Flash写真の更新');	// Sx系（商品紹介）のタイトル

#=================================================================================
# 画像情報の指定
#=================================================================================
// 画像ファイルパス（管理画面のみで使用）
define('P1_IMG_PATH','../../P1/up_img/');

// 画像枚数（最大登録枚数は８枚まで）
define('P1_IMG_CNT',1);

// アップロードサイズ上限(MB)
define('MAX_MB',2);

// 画像ファイルサイズ
define('P1_IMGSIZE_MX',500);	// アップロード画像幅（befor）
define('P1_IMGSIZE_MY',300);	// アップロード画像高（befor）
?>
