<?php
/*******************************************************************************
更新プログラム

	ＤＢ情報取得処理ファイル

2005/05/06 Author K.C
*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if( !$_SERVER['PHP_AUTH_USER'] || !$_SERVER['PHP_AUTH_PW'] ){
	header("HTTP/1.0 404 Not Found"); exit();
}
if(!$injustice_access_chk){
	header("HTTP/1.0 404 Not Found");exit();
}

	///////////////////////////////////////////
	// 更新指示のあった該当データの取得

		$sql = "
		SELECT
			WORDS,
			UPD_DATE
		FROM
			".NG_WORDS."
		WHERE
			(KEY_ID = '9999')
		";

// ＳＱＬを実行
$fetch = dbOpe::fetch($sql,DB_USER,DB_PASS,DB_NAME,DB_SERVER);

?>