<?php
/*******************************************************************************
プログラム バックオフィス
メインコントローラー

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if( !$_SERVER['PHP_AUTH_USER'] || !$_SERVER['PHP_AUTH_PW'] ){
	header("Location: ../");exit();
}

// 不正アクセスチェックのフラグ
$accessChk = 1;

define('BEST_COUNT',10);//売り上げベスト１０でのリミット

// 澄2艨tァイル＆汲枢♂イブラリｖ藻"・桙
require_once("../../common/INI_config.php");		// 設定情報
require_once("../../common/INI_ShopConfig.php");	// ショップ用設定情報
require_once("dbOpe.php");					// DB操肴¨ラスライブラリ
require_once("util_lib.php");				// 白頻処理クラスライブラリ

#===============================================================================
# $_POST["action"]ｖ隊鋲ｕ"縲芻・揩闢・
#===============================================================================

	include("LGC_getDB-data.php");
	include("DISP_listview.php");

?>