<?php
/*******************************************************************************
更新プログラム

	DB登録・更新処理

2005/05/06 Author K.C
*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if( !$_SERVER['PHP_AUTH_USER'] || !$_SERVER['PHP_AUTH_PW'] ){
	header("HTTP/1.0 404 Not Found"); exit();
}
// 不正アクセスチェック（直接このファイルにアクセスした場合）
if(!$injustice_access_chk){
	header("HTTP/1.0 404 Not Found");exit();
}

if($_POST["regist_type"] == "update"){

	#-----------------------------------------------------
	# 既存CATEGORY更新用SQLの組立
	#-----------------------------------------------------
	$sql = "
	UPDATE
		".NG_WORDS."
	SET
		WORDS = '$words',
		UPD_DATE = NOW()
	WHERE
		(KEY_ID = '9999')
	";
}
// ＳＱＬを実行
if(!empty($sql)){
	$db_result = dbOpe::regist($sql,DB_USER,DB_PASS,DB_NAME,DB_SERVER);
	if($db_result)die("DB登録失敗しました<hr>{$db_result}");

}

?>