<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

【/back_office/log/】フォルダーのパーミッションを777に指定してください
【/back_office/log/sendmailCLI_log.log】ファイルのパーミッションを777に指定してください

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('MEMBER_TITLE','会員管理メール配信の更新');	// Hx系（会員管理メール配信の更新）のタイトル

#=================================================================================
# 最大登録件数の指定
#=================================================================================
define('MEMBER_DBMAX_CNT',10000);	// Hx系（会員管理メール配信の更新）の最大登録件数

#=================================================================================
# 最大表示件数の指定
#=================================================================================
define('MEMBER_DISP_MAXROW',20);	// Hx系（会員管理メール配信の更新）の 1ページの最大表示件数

#=================================================================================
# メール送信の設定
#=================================================================================

	//メールの差出人の名前（会社名）
	//$company_name = WEBMST_NAME;//ショップ用の設定
	//$company_name = "株式会社オールインターネット";//config_H1A.phpの設定を読み込む
	$company_name = "自動送信メール";//config_H1A.phpの設定を読み込む

	//送信元
	//$web_mail = WEBMST_CONTACT_MAIL;//ショップ用の設定
	$web_mail = getInitData("EMAIL1");

	// 会社INFO
	//$company_info = COMPANY_INFO;//ショップ用の設定
	$company_info = "";
/*	$company_info = "
*********************************
株式会社ジーク

〒150-0043
東京都千代田区三崎町２－４－１
ＴＵＧ－Ｉビル３Ｆ/１０Ｆ
TEL:03-3263-0219  FAX:03-3263-0217
URL:　http://www.zeek.jp/

■本格的なWEB制作・コンサルティング

WebMind（ウェブマインド）
http://www.webmind.jp/

■中小企業のためのWEB制作

ALL-INTERNET（オールインターネット）
http://www.all-internet.jp/

*********************************
";*/

#=================================================================================
# データベースの指定
#=================================================================================
define('MEMBER_LST','H1A_MEMBER_NEW');

#=================================================================================
# 会員情報のＣＳＶ出力の指定
#
# 管理画面で会員情報をＣＳＶ出力を行います。
# ０：出力を許可しない　１：出力を許可する
# 有効には１ポイント必要の為、仕様は確認すること
#=================================================================================
$csv_output = 0;

#=================================================================================
# プルダウンメニュー用 配列データ
#
# 項目の変更が有りそうな場合はデータベースでの
# 入力の方が良いと思われます。
# （項目の位置の変更、項目数の変更などの場合、整合性が保て無くなる場合がある）
#=================================================================================

//都道府県
$state_list = array(
"",
"北海道","青森県","岩手県","宮城県","秋田県","山形県","福島県","茨城県","栃木県","群馬県",
"埼玉県","千葉県","東京都","神奈川県","新潟県","富山県","石川県","福井県","山梨県","長野県",
"岐阜県","静岡県","愛知県","三重県","滋賀県","京都府","大阪府","兵庫県","奈良県","和歌山県",
"鳥取県","島根県","岡山県","広島県","山口県","徳島県","香川県","愛媛県","高知県","福岡県",
"佐賀県","長崎県","熊本県","大分県","宮崎県","鹿児島県","沖縄県"
);

//年代
$generation_list = array(
"",
"１０代","２０代","３０代","４０代","５０代","６０代以上"
);

//職業
$job_list = array(
"",
"大学生","会社員","公務員","自営業","主婦","その他"
);

//メール送信時に実態参照の文字を変換させる
function html_char_conv(&$str){

	//$str = str_replace("&amp;","＆",$str);
	$str = str_replace("&amp;","&",$str);
	//$str = str_replace("&","＆",$str);
	$str = str_replace("&quot;","”",$str);
	$str = str_replace("&#39","’",$str);
	$str = str_replace("'","’",$str);
	$str = str_replace("&lt;","＜",$str);
	$str = str_replace("&gt;","＞",$str);

	return $str;
}

?>
