<?php
/*******************************************************************************
ALL-INTERNET BLOG

Logic：DB登録・更新処理

*******************************************************************************/

#=================================================================================
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#=================================================================================
if (!$_SESSION['LOGIN']) {
    header("Location: ../err.php");
    exit();
}
// 不正アクセスチェック（直接このファイルにアクセスした場合）
if (!$accessChk) {
    header("Location: ../");
    exit();
}

#=================================================================================
# POSTデータの受取と文字列処理（共通処理）	※汎用処理クラスライブラリを使用
#=================================================================================
// タグ、空白の除去／危険文字無効化／“\”を取る／半角カナを全角に変換
extract(utilLib::getRequestParams("post", [8,7,1,4], true));

// MySQLにおいて危険文字をエスケープしておく
$title = utilLib::strRep($title, 5);
$content = utilLib::strRep($content, 5);
$name = utilLib::strRep($name, 5);

#=================================================================================
# 新規か更新かによって処理を分岐	※判断は$_POST["regist_type"]
#=================================================================================
switch ($_POST["regist_type"]):
case "update":
//////////////////////////////////////////////////////////
// 対象IDのデータ更新

    // 対象記事IDデータのチェック
    if (!preg_match("/^([0-9]{10,})-([0-9]{6})$/", $comment_id)||empty($comment_id)) {
        die("致命的エラー：不正な処理データが送信されましたので強制終了します！<br>{$comment_id}");
    }

    // 画像ファイル名の決定（POSTで渡された既存の記事ID（$res_id）を使用）
    $for_imgname = $res_id; // POSTで渡された既存記事IDを使用

    // DB格納用のSQL文
    $sql = "
	UPDATE
		BLOG_COMMENT_LST
	SET
		TITLE      		  = '$title',
		NAME              = '$name',
		EMAIL             = '$e_mail',
		CONTENT 		  = '$content',
		DISPLAY_FLG 	  = '$display_flg',
		UPD_DATE          = NOW()
	WHERE
		(COMMENT_ID = '$comment_id')
	";

    break;

default:
    die("致命的エラー：登録フラグ（regist_type）が設定されていません");
endswitch;

// ＳＱＬを実行
if (!empty($sql)) {
    $PDO->regist($sql);
}
