<?php
/*******************************************************************************
 
 見出しブロック
 ver 1.0
 
*******************************************************************************/

#=================================================================================
# ■1. ブロックIDの設定
#   重複するので下記の変数このファイル以外で使いまわせません。
#=================================================================================
# ブロックID ※エントリーしたい数値を0～999で指定してください。
$BLOCK_ID = 2;


# --------------------------------------------------------------------------------
# チェック
# --------------------------------------------------------------------------------

if("block".$BLOCK_ID.".php" != basename(__FILE__)){
	 die("エラー".__FILE__."&nbsp;|&nbsp;現在の\$BLOCK_ID = {$BLOCK_ID}<br>".
		 "ファイル名はblock{ブロックID}.phpになるよう統一してください。<br>".
		 "例：\$BLOCK_ID = 1;　の場合ファイル名は「block1.php」としてください。：");
}

if(is_array($BLOCK_DATA[$BLOCK_ID])){
 die("エラー".__FILE__."<br>"."ブロックIDが重複しています。");}
else {$BLOCK_DATA[$BLOCK_ID] = array();}

#=================================================================================
# ■2. 初期設定
#=================================================================================
# ブロックID
$BLOCK_DATA[$BLOCK_ID]['BLOCK_ID']	=	$BLOCK_ID;


# ブロック名
$BLOCK_DATA[$BLOCK_ID]['BLOCK_NAME']	=	"見出し";


# DBに登録する値の最大数
$BLOCK_DATA[$BLOCK_ID]['VALUE_MAXNUM']	=	1;


# 保存するファイルの最大数
$BLOCK_DATA[$BLOCK_ID]['FILE_MAXNUM']	=	0;


# 管理画面の入力項目の表示（カンマ区切りで指定）
$BLOCK_DATA[$BLOCK_ID]['BLOCK_ITEM_ORDER']	=	"t001";


# 管理画面の画像項目の表示（カンマ区切りで指定）
$BLOCK_DATA[$BLOCK_ID]['BLOCK_FILE_ORDER']	=	"";


# 管理画面の入力項目名の表示（カンマ区切りで指定）
$BLOCK_DATA[$BLOCK_ID]['BLOCK_ITEM_NAME']	=	"見出しテキスト";


# 管理画面の画像項目名の表示（カンマ区切りで指定）
$BLOCK_DATA[$BLOCK_ID]['BLOCK_FILE_NAME']	=	"";


# デフォルトの登録画像サイズ（カンマ区切りで指定）
$BLOCK_DATA[$BLOCK_ID]['DEF_IMG_WIDTH']	=	"";


# 管理画面項目の注意文
$BLOCK_DATA[$BLOCK_ID]['ATTENTION_MES']	=	"";


# 表示を行う際に呼ばれる関数
$BLOCK_DATA[$BLOCK_ID]['FUNCTION']	=	"BLOCK2";


#=================================================================================
# ■3. 表示用関数
#	BLOCK***($fetch,$param)
#   ***の部分はブロックIDなどユニークの値にしておいてください。
#  -------------------------------------------------------------------------------
#  $fetch : データ一覧
#  $param : 必要なデータは引数を増やさず、配列の要素を増やしてください。
#  -------------------------------------------------------------------------------
#  送られてくるパラメータ情報
#  $param['color'] 		： カラーID
#  $param['group_id']	： グループID
#  $param['lid']		： レイアウトID
#  $param['lng']		： 言語
#  $param['group_folder_name']： フォルダ名
#=================================================================================

function BLOCK2($fetch,$param){
	
	$v1 = $fetch['TEXT1'];
	
	$html .= <<<HTML
				<h5><span>{$v1}</span></h5>

HTML;

	return $html;
}
?>