<?php
/*******************************************************************************
会員メール配信 バックオフィス（MySQL対応版）
Logic：配信チェックの内容をDBに格納する

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if( !$_SESSION['LOGIN'] ){
	header("Location: ../err.php");exit();
}

if( !$injustice_access_chk){
	header("Location: ../"); exit();
}

#=================================================================================
# 一回フラグをOFFにします。
#=================================================================================

$sql = "
UPDATE
	" . MEMBER_LST . "
SET
	SENDMAIL_FLG   = '0'
";
if(!empty($sql)){
	$db_result = dbOpe::regist($sql,DB_USER,DB_PASS,DB_NAME,DB_SERVER);
	if($db_result)die("DB登録失敗しました<hr>{$db_result}");
}

#=================================================================================
# SQL組立
#=================================================================================

for($i=0;$i<count($member_id);$i++):

	if($send_check[$i]==1){
		$sendup=1;
	}
	elseif($send_check[$i]==""){
		$sendup=0;
	}

	$sql = "
	UPDATE
		" . MEMBER_LST . "
	SET
		SENDMAIL_FLG   = '".$sendup."'
	WHERE
		(MEMBER_ID = '".$member_id[$i]."')
	";

#=================================================================================
# SQL実行
#=================================================================================
if(!empty($sql)){
	$db_result = dbOpe::regist($sql,DB_USER,DB_PASS,DB_NAME,DB_SERVER);
	if($db_result)die("DB登録失敗しました<hr>{$db_result}");
}
endfor;

?>
