<?php
/*******************************************************************************
all-internetblog（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("dbOpe.php");            // ＤＢ操作クラスライブラリ
require_once("util_lib.php");        // 汎用処理クラスライブラリ

#=================================================================================
# マルチバイト関数用に言語と文字コードを指定する（文字列置換、メール送信等で必須）
#=================================================================================
mb_language("Japanese");
mb_internal_encoding("UTF-8");

//エラーメッセージの表示の時エンコードがsjisで文字化けをするのを回避
    header("Content-Type: text/html; charset=UTF-8");
    header("Content-Language: ja");

date_default_timezone_set('Asia/Tokyo');//php 5.3.0から時間設定をしないと警告が出てしまうためここで設定をする。


#=================================================================================
# ＤＢ接続の情報（定数化）
#=================================================================================
define('DB_SERVER', 'localhost');
define('DB_NAME', 'site10_db');
define('DB_USER', 'site10_db');
define('DB_PASS', '371VtfE7');
define('DB_DSN', "mysql:dbname=".DB_NAME.";host=".DB_SERVER.";charset=utf8;");
$PDO = new dbOpe(DB_DSN, DB_USER, DB_PASS);

#=================================================================================
#  RSSのパス設定
#=================================================================================
//rss.phpファイルの設置する階層をあわせる（デフォルトはトップ階層を指定）
define('BLOG_SITE_LINK', 'http://'.$_SERVER["HTTP_HOST"]);    // サイトURL(httpからの絶対パス)

#=================================================================================
# デザイン変更用CSSファイル絶対パス
#=================================================================================
define('CSS_FILE_PATH', 'http://zeek.jp/blogstyle/');

#=================================================================================
# Aタグを絶対パスでリンクを制御（表のパスのみに使用）
# リライトを行っているので絶対パスでの指定で制御しないとパスがずれていく
#=================================================================================
if (strpos($_SERVER['PHP_SELF'], "zeeksdg")=="") {
    //本番用
    define('RL_PATH', '/new_sample_base_update/site_win_5s10s_update/R1_update/blog/');//本番用 リンク用
    define('RI_PATH', '/new_sample_base_update/site_win_5s10s_update/R1_update/');//本番用 アップされた画像用
    //define('IMG_TMPPATH','/tmg_img/');//（写メールのテンポラリフォルダ）
    //define('IMG_UPPATH','/up_img/');	//（写メールの保存フォルダ）
} else {
    //デモ用
    define('RL_PATH', '/zeeksdg/R1_cu/blog/');//デモ用 リンク用
    define('RI_PATH', '/zeeksdg/R1_cu/');//デモ用 アップされた画像用
    //define('IMG_TMPPATH','/zeeksdg/R1_cu/tmg_img/');//（写メールのテンポラリフォルダ）
    //define('IMG_UPPATH','/zeeksdg/R1_cu/up_img/');	//（写メールの保存フォルダ）
}

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('FOOTER_TITLE', '');

#=================================================================================
# 最大登録件数の指定
#=================================================================================
define('DISP_MAXROW', 1);    // 1ページの最大表示件数（共通）
define('DISP_ENTRY_MAXROW', 10);    // 管理画面エントリ1ページの最大表示件数
define('DISP_COMMENT_MAXROW', 10);    // 管理画面コメント1ページの最大表示件数
define('ENTRY_MAXROW', 100);    // エントリーの最大登録件数

#=================================================================================
# 画像情報の指定
#=================================================================================
// 画像ファイルパス（管理画面のみで使用）
define('IMG_FILE_PATH', '../../up_img/');

// 画像枚数
define('IMG_COUNT', 1);

// 画像ファイルサイズ
define('CA_IMGSIZE_SX', 16);    // カテゴリー用アイコン画像幅
define('CA_IMGSIZE_SY', 12);    // カテゴリー用アイコン画像高
define('IMGSIZE_SX', 40);      // アップロード画像幅（管理画面サムネイル用）
define('IMGSIZE_SY', 30);      // アップロード画像高（管理画面サムネイル用）
define('IMGSIZE_MX', 240);      // アップロード画像幅
define('IMGSIZE_MY', 180);      // アップロード画像高
define('IMGSIZE_MX2', 80);      // アップロード画像幅（WhatsNew用）
define('IMGSIZE_MY2', 60);      // アップロード画像高（WhatsNew用）
define('IMGSIZE_LX', 760);   // ヘッダー画像横
define('IMGSIZE_LY', 200);   // ヘッダー画像縦

define('P_IMGSIZE_X', 170);   // プロフィール画像横
define('P_IMGSIZE_Y', 126);   // プロフィール画像縦

#=================================================================================
# 頻繁に行う簡易処理のファンクション化（匿名関数）
#=================================================================================
// UNIX時間＋マイクロ秒によるID生成
$makeID = create_function('', 'return date("U")."-".sprintf("%06d",(microtime() * 1000000));');

// パスワード作成
$makePass = create_function('', '$pass = crypt(mt_rand(0,99999999),"CP");return preg_replace("/[^a-zA-Z0-9]/","",$pass);');

#=================================================================================
# 管理者情報テーブルよりメールアドレスを取得するファンクション
#	メソッド名：getInitData("カラム名")
#=================================================================================
function getInitData($colum = "")
{
    global $PDO;
    if (!$colum) {
        $colum = "EMAIL1";
    }
    $sql = "SELECT {$colum} FROM BLOG_APP_INIT_DATA WHERE(RES_ID = '1')";
    $fetch = $PDO->fetch($sql);
    return $fetch[0][$colum];
}

#=================================================================================
# 管理情報テーブルよりIPリストを取得するファンクション
#	メソッド名：getPermitIPList("ID名")
#=================================================================================
function getPermitIPList($bo_id)
{
    global $PDO;
    if (!$bo_id || empty($bo_id)) {
        return false;
    }
    $sql = "SELECT PERMIT_IP_LST FROM BLOG_APP_ID_PASS WHERE(BO_ID = '".utilLib::strRep($bo_id, 5)."')";
    $fetch = $PDO -> fetch($sql);
    return explode(",", $fetch[0]["PERMIT_IP_LST"]);
}

#=================================================================================
# ＨＴＭＬタグの有効処理
#
# 【back_office/n○whatsnew/LGC_regist.php】でＨＴＭＬタグの有効処理の上に
# addslashesの処理を行っておりますが、こちらの処理でもaddslashesをおこなっております。
# 二重に処理を行わないよう注意をしてください。
# （二重に処理をしますとaddslashesが無効になります。）
#=================================================================================
function html_tag($str)
{
    $str  = mb_convert_kana($str, "KV");//半角を全角に変換処理
    $str = strip_tags($str, "<a><b><span><i><u><p><img><iframe><object><param><embed><strong><em>");
    $str = utilLib::strRep($str, 7); // 前後の空白除去
    $str  = utilLib::strRep($str, 4); // stripslashes
    $str  = utilLib::strRep($str, 5); // addslashes

    return $str;
}
$layer_free = "Layer_free";//カラーボタンの付近にレイヤーを表示するレイヤー用

#=================================================================================
# 外部リンク登録機能のタイトル
#=================================================================================
define('LINK_TITLE', '外部リンクの更新');

#=================================================================================
# 外部リンク最大登録件数の指定
#=================================================================================
define('LINK_DBMAX_CNT', 10);    // Sx系（商品紹介）の最大登録件数

#=================================================================================
# 外部リンク最大表示件数の指定
#=================================================================================
define('LINK_DISP_MAXROW', 10);    // Sx系（商品紹介）の 1ページの最大表示件数

// 1行の列数※クロス表示でない場合は１を設定
define('LINE_MAXCOL', 1);

#=================================================================================
# データベースでの外部リンクテーブル名の指定
#=================================================================================
define('BLOG_LINK_LST', 'BLOG_LINK_LST');    //登録データ

// バナー画像ファイルサイズ
define('IMGSIZE_BX', 170);   // バナー画像横
define('IMGSIZE_BY', 120);   // バナー画像縦
