<?php
/*******************************************************************************
rss用設定ファイル
 RSSファイルのエンコードはUTF-8なので他のファイルとの併用はなるべく避ける
*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("blog_config.php");    // 共通設定情報

#=================================================================================
# 定数設定
#=================================================================================
define('BLOG_DIR', 'blog');    // RSSを出力するコンテンツのディレクトリ （一覧ページのフォルダを指定する）
define('BLOG_RSS_TITLE', '株式会社○○ ブログ'); // RSSタイトル
define('BLOG_RSS_DESCRIPTION', '株式会社○○は、本当に効果のあるプロモーション映像をお求めの方は、お気軽にご連絡ください。');//RSS記述
define('BLOG_RSS_CREATOR', '株式会社○○');//RSS提供者

#=================================================================================
# 最大表示件数の指定
#=================================================================================
define('BLOG_RSS_DISP_MAXROW', 100);    // 1ページの最大表示件数
define('BLOG_RSS_DBMAX_CNT', 100);    // 最大登録件数

#=================================================================================
# データベースでのテーブル名の指定
#=================================================================================
define('BLOG_RSS_TABLE', 'BLOG_ENTRY_LST'); // DBテーブル
