<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('TITLE','商品紹介の更新');	// Sx系（商品紹介）のタイトル
define('CATE_TITLE','商品紹介カテゴリーの更新');	// Sx系（商品紹介）カテゴリーのタイトル

#=================================================================================
# 最大登録件数の指定
# カテゴリーは無制限で登録が可能
#=================================================================================
define('DBMAX_CNT',100);	// Sx系（商品紹介）の最大登録件数

#=================================================================================
# 最大表示件数の指定
#=================================================================================
define('DISP_MAXROW',10);	// Sx系（商品紹介）の 1ページの最大表示件数

define('DISP_MAXROW_BACK',10);	// 管理画面での1ページの最大表示件数

// 1行の列数※クロス表示でない場合は１を設定
define('LINE_MAXCOL',1);

#=================================================================================
# データベースでのテーブル名の指定
#=================================================================================
define('S7_3_PRODUCT_LST','S7_3_PRODUCT_LST');	//商品データ
define('S7_3_CATEGORY_MST','S7_3_CATEGORY_MST');	//カテゴリー
define('S7_3_VIEW_ORDER_LIST','S7_3_VIEW_ORDER_LIST');	//各データの並び順

//各データの並び順（mysqlのバージョンが4.0.14前だとinsert selectが出来ないので補佐用のテーブル）
//バージョンが4.0.14の場合できれば4.0.14以降での処理をオススメ　修正する箇所は
//【/back_office/s7_3rd_product/LGC_regist.php】ファイルでのinsert selectでの4.0.14前処理を部分をコメントアウトして
//4.0.14以降のコメントアウトをはずすだけ、283行,386行,464行,467行の合計で4箇所と【LGC_del_and_dispchng.php】【LGC_select_del_and_dispchng.php】の削除処理の箇所をコメントアウト
define('S7_3_VIEW_ORDER_LIST2','S7_3_VIEW_ORDER_LIST2');

#=================================================================================
# 表画面のフォルダの指定(管理画面のみで使用・プレビュー用)
#=================================================================================
define('PREV_PATH','../../S7_3rd/');

#=================================================================================
# 画像情報の指定
#=================================================================================
// 画像ファイルパス（管理画面のみで使用）
define('IMG_PATH','../../S7_3rd/up_img/');

// 画像枚数
define('IMG_CNT',4);

// アップロードサイズ上限(MB)
define('MAX_MB',2);

// 画像ファイルサイズ
define('IMGSIZE_SX',40);	// 管理画面サムネイル用
define('IMGSIZE_SY',30);	// 管理画面サムネイル用
define('IMGSIZE_MX1',100);	// アップロード画像幅（商品紹介／高自動算出）
define('IMGSIZE_MY1',100);	// アップロード画像高（商品紹介／幅自動算出）
define('IMGSIZE_MX2',200);	// アップロード画像幅（商品紹介／高自動算出）
define('IMGSIZE_MY2',200);	// アップロード画像高（商品紹介／幅自動算出）

	//定数を配列に格納しておく（back_office/s7_product/LGC_regist.phpで使用）
	$ox = array(IMGSIZE_MX1,IMGSIZE_MX2,IMGSIZE_MX2,IMGSIZE_MX2);
	$oy = array(IMGSIZE_MY1,IMGSIZE_MY2,IMGSIZE_MY2,IMGSIZE_MY2);

?>