<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('B1_TITLE','BBSの管理（B1）');	// Sx系（商品紹介）のタイトル

#==================================================================================
# BBS関連の設定
#==================================================================================
define('BBS_LOG_MST_DATA','BBS_LOG_MST_DATA');		// LOG MASTER LIST
define('BBS_LOG_SUB_DATA','BBS_LOG_SUB_DATA');		// LOG SUB LIST
define('NG_WORDS','NG_WORDS');						// NG WORDS

define('BBS_IMAGE','0');

define('BBS_BO_MAX',5);		// BBS バックオフィス用
define('BBS_MAX',5);		// BBS 表示ページ用

?>