<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('TITLE','新着情報の更新');	// Nx系（新着情報）のタイトル
define('CATE_TITLE','新着情報カテゴリーの更新');	// Nx系（新着情報）カテゴリーのタイトル

#=================================================================================
# 最大登録件数の指定
# カテゴリーは無制限で登録が可能
#=================================================================================
define('DBMAX_CNT',50);	// Nx系（新着情報）の最大登録件数

#=================================================================================
# 最大表示件数の指定
#=================================================================================
define('DISP_MAXROW',10);	// Nx系（新着情報）の 1ページの最大表示件数

define('DISP_MAXROW_BACK',50);	// 管理画面での1ページの最大表示件数

// 1行の列数※クロス表示でない場合は１を設定
//define('LINE_MAXCOL',3);

#=================================================================================
# データベースでのテーブル名の指定
#=================================================================================
define('N3_S7_WHATSNEW',' N3_S7_WHATSNEW');	//商品データ
define('N3_S7_CATEGORY_MST','N3_S7_CATEGORY_MST');//カテゴリー
define('N3_S7_WHATSNEW_PAGE','N3_S7_WHATSNEW_PAGE');	//ページネーション表示件数

#=================================================================================
# 表画面のフォルダの指定(管理画面のみで使用・プレビュー用)
#=================================================================================
define('PREV_PATH','../../news_N3_S7/');

#=================================================================================
# 画像情報の指定
#=================================================================================
// 画像ファイルパス（管理画面のみで使用）
define('IMG_PATH','../../news_N3_S7/up_img/');
// 画像枚数
define('IMG_CNT',1);
// アップロードサイズ上限(MB)
define('MAX_MB',2);

// 画像ファイルサイズ
define('IMGSIZE_SX',40);	// 管理画面サムネイル用
define('IMGSIZE_SY',30);	// 管理画面サムネイル用
define('IMGSIZE_MX1',100);	// アップロード画像幅（商品紹介／高自動算出）
define('IMGSIZE_MY1',100);	// アップロード画像高（商品紹介／幅自動算出）
define('IMGSIZE_MX2',200);	// アップロード画像幅（商品紹介／高自動算出）
define('IMGSIZE_MY2',200);	// アップロード画像高（商品紹介／幅自動算出）

//定数を配列に格納しておく（back_office/s7_product/LGC_regist.phpで使用）
$ox = array(IMGSIZE_MX1);
$oy = array(IMGSIZE_MY1);

?>