<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('S6_3TITLE','商品紹介の更新');	// Sx系（商品紹介）のタイトル

#=================================================================================
# 最大登録件数の指定
#=================================================================================
define('S6_3DBMAX_CNT',100);	// Sx系（商品紹介）の最大登録件数

#=================================================================================
# データベースでのテーブル名の指定
#=================================================================================
define('S6_3PRODUCT_LST','S6_3PRODUCT2_LST');	//登録データ

#=================================================================================
# 最大表示件数の指定
#=================================================================================
define('S6_3DISP_MAXROW',10);	// Sx系（商品紹介）の 1ページの最大表示件数

define('DISP_MAXROW_BACK',10);	// 管理画面での1ページの最大表示件数

// 1行の列数※クロス表示でない場合は１を設定
define('LINE_MAXCOL',1);

#=================================================================================
# 表画面のフォルダの指定(管理画面のみで使用・プレビュー用)
#=================================================================================
define('PREV_PATH','../../S6_3/');

#=================================================================================
# 画像情報の指定
#=================================================================================
// 画像ファイルパス（管理画面のみで使用）
define('S6_3IMG_PATH','../../S6_3/up_img/');
// 画像枚数
define('S6_3IMG_CNT',4);

// アップロードサイズ上限(MB)
define('MAX_MB',2);

// 画像ファイルサイズ
define('S6_3IMGSIZE_SX',40);	// 管理画面サムネイル用
define('S6_3IMGSIZE_SY',30);	// 管理画面サムネイル用
define('S6_3IMGSIZE_MX1',150);	// アップロード画像幅（商品紹介／高自動算出）
define('S6_3IMGSIZE_MY1',150);	// アップロード画像高（商品紹介／幅自動算出）
define('S6_3IMGSIZE_MX2',200);	// アップロード画像幅詳細用（商品紹介／高自動算出）
define('S6_3IMGSIZE_MY2',200);	// アップロード画像高詳細用（商品紹介／幅自動算出）

	//定数を配列に格納しておく（back_office/6_2product/LGC_regist.phpで使用）
	$ox = array(S6_3IMGSIZE_MX1,S6_3IMGSIZE_MX2,S6_3IMGSIZE_MX2,S6_3IMGSIZE_MX2);
	$oy = array(S6_3IMGSIZE_MY1,S6_3IMGSIZE_MY2,S6_3IMGSIZE_MY2,S6_3IMGSIZE_MY2);

#=================================================================================
# 管理画面のデータ並び替えのタイプ
# 1 新しいタイプの並び替えPG
# 0 古いタイプの並び替えPG
#=================================================================================
define('S6_3_SORT_TYPE','1');	// Sx系（商品紹介）のタイトル

?>