<?php
/*******************************************************************************
Px系プログラム バックオフィス（MySQL対応版）
Logic：DB登録・更新処理

*******************************************************************************/

#=================================================================================
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#=================================================================================
if( !$_SESSION['LOGIN'] ){
	header("Location: ../err.php");exit();
}
if( !$_SERVER['PHP_AUTH_USER'] || !$_SERVER['PHP_AUTH_PW'] ){
//	header("Location: ../");exit();
}
// 不正アクセスチェック（直接このファイルにアクセスした場合）
if(!$accessChk){
	header("Location: ../");exit();
}

#=================================================================================
# POSTデータの受取と文字列処理（共通処理）	※汎用処理クラスライブラリを使用
#=================================================================================
// タグ、空白の除去／危険文字無効化／“\”を取る／半角カナを全角に変換
extract(utilLib::getRequestParams("post",array(8,7,1,4),true));

#=================================================================================
# 新規か更新かによって処理を分岐	※判断は$_POST["regist_type"]
#=================================================================================
switch($_POST["regist_type"]):
case "update":
//////////////////////////////////////////////////////////
// 対象IDのデータ更新

	// 画像ファイル名の決定（POSTで渡された既存の記事ID（$res_id）を使用）
	$for_imgname = 'photo0'; // POSTで渡された既存記事IDを使用

	// 削除指示がされていたら実行(複数)
	if($_POST["regist_type"]=="update" && $del_img){
		foreach($del_img as $k => $v){
		 	search_file_del(P1_IMG_PATH,$for_imgname.$v.".*");
		}
	}

	break;

default:
	die("致命的エラー：登録フラグ（regist_type）が設定されていません");
endswitch;
#=================================================================================
# 共通処理；画像アップロード処理
#=================================================================================
// 画像処理クラスimgOpeのインスタンス生成
$imgObj = new imgOpe(P1_IMG_PATH);

// 画像ファイル名の決定(記事のIDを使用)
$for_imgname = 'photo0';

// 設定ファイルの画像最大登録枚数分ループ
for($i=1;$i<P1_IMG_CNT+1;$i++):

// アップロードされた画像ファイルがあればアップロード処理
if(is_uploaded_file($_FILES['up_img']['tmp_name'][$i])){

	//古いファイルは拡張子をワイルドカードにして削除（拡張子が違っている場合古いファイルは上書きで消えない為）
	search_file_del(P1_IMG_PATH,$for_imgname.$i.".*");

	// アップされてきた画像のサイズを計る
	$size = getimagesize($_FILES['up_img']['tmp_name'][$i]);

	//画像サイズを調整
	//$size_x = $ox[$i-1];//横の固定サイズ
	//$size_y = $size[1]/($size[0]/$size_x);
	$size_x = P1_IMGSIZE_MX;
	$size_y = P1_IMGSIZE_MY;

	// 画像のアップロード：画像名は(記事ID_画像番号.jpg)
	$imgObj->setSize($size_x, $size_y);

	if(!$imgObj->up($_FILES['up_img']['tmp_name'][$i],$for_imgname.$i)){
		exit("画像のアップロード処理に失敗しました。");
	}

}
endfor;

?>
