<?php
/*******************************************************************************
ALL-INTERNET BLOG

並び替え：メインコントローラー

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
session_start();
if (!$_SESSION['LOGIN']) {
    header("Location: ../../err.php");
    exit();
}

// 設定ファイル＆共通ライブラリの読み込み
require_once("../../../common/blog_config.php");        // 共通設定情報

#===============================================================================
# $_POST['status']の内容により処理を分岐
#===============================================================================
switch ($_POST['status']):
case "view_order_update":
//////////////////////////////////////////////////////////////////////
// 新しく並び変えた順番に更新する

    include("LGC_update_view_order.php");

default:
//////////////////////////////////////////////////////////////////////
// 現在の表示順に商品リストを表示

    include("LGC_getDB-data.php");
    include("DISP_listview.php");

    break;
endswitch;

// デバッグ用
/*
print_r($_POST);
echo "<hr>";
print_r($_SESSION);
*/
