<?php
/*******************************************************************************
管理者情報
Logic：ＤＢより情報を取得

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if( !$_SESSION['LOGIN'] ){
	header("Location: ../err.php");exit();
}
if( !$_SERVER['PHP_AUTH_USER'] || !$_SERVER['PHP_AUTH_PW'] ){
//	header("HTTP/1.0 404 Not Found"); exit();
}

//////////////////////////////////////////////////////////////////
// DBより全管理者情報を取得する

$sql = "SELECT EMAIL1,EMAIL2,CONTENT FROM APP_INIT_DATA WHERE(RES_ID = '1')";
$fetch =  $PDO -> fetch($sql);

?>
