<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('S14_TITLE','オススメ商品紹介の更新');	// Sx系（商品紹介）のタイトル

#=================================================================================
# 画像情報の指定
#=================================================================================
// 画像ファイルパス（管理画面のみで使用）
define('S14_IMG_PATH','../../S14/up_img/');

// 画像ファイルサイズ
define('S14_IMGSIZE_SX',40);	// 管理画面サムネイル用
define('S14_IMGSIZE_SY',30);	// 管理画面サムネイル用

define('S14_IMGSIZE_MX',200);	// アップロード画像幅（商品紹介）
define('S14_IMGSIZE_MY',150);	// アップロード画像高（商品紹介）
?>