<?php
/*******************************************************************************
ALL-INTERNET BLOG

カテゴリーメニュー
Logic：ＤＢより情報を取得

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if (!$_SESSION['LOGIN']) {
    header("Location: ../err.php");
    exit();
}
// 不正アクセスチェック（直接このファイルにアクセスした場合）
if (!$injustice_access_chk) {
    header("HTTP/1.0 404 Not Found");
    exit();
}

#===============================================================================
# $_POST["status"]の内容によりＤＢより取得する情報を分岐
#===============================================================================
switch ($_POST["status"]):
case "edit":
//////////////////////////////////////////////////////////////////
// 更新情報取得

    #========================================================================
    # POSTデータの受け取りと共通な文字列処理
    #========================================================================
    extract(utilLib::getRequestParams("post", [8,7,1,4,5]));

    // 該当を取得
    $sql = "
	SELECT
		CATEGORY_CODE,
		CATEGORY_NAME
	FROM
		BLOG_CATEGORY_MST
	WHERE
		(CATEGORY_CODE = '$category_code')
	AND
		(DEL_FLG='0')
	ORDER BY
		VIEW_ORDER
	";

    $fetch = $PDO->fetch($sql);

    break;
default:
////////////////////////////////////////////////////////////////////
// カテゴリーリストをデータをＤＢより取得

    $sql = "
	SELECT
		CATEGORY_CODE,
		CATEGORY_NAME,
		DISPLAY_FLG
	FROM
		BLOG_CATEGORY_MST
	WHERE
		(DEL_FLG='0')
	ORDER BY
		VIEW_ORDER
	";

    $fetchList = $PDO->fetch($sql);

endswitch;
