<?php
/*******************************************************************************
Sx系プログラム バックオフィス（MySQL対応版）
Logic:以下の処理を行う
    ・表示/非表示の切替(DISPLAY_FLGの切替)
    ・削除処理	※完全にデータを削除します。(DELETE文)

※$_POST["action"]の内容で分岐

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#---------------------------------------------------------------
if (!$_SESSION['LOGIN']) {
    header("Location: ../err.php");
    exit();
}
if (!$accessChk) {
    header("Location: ../");
    exit();
}

#----------------------------------------------------------------
# POSTデータの受取と共通な文字列処理（対象IDが不正：強制終了）
#----------------------------------------------------------------
extract(utilLib::getRequestParams("post", array(8,7,1,4)));

// 対象記事IDデータのチェック
if (!is_numeric($cate)) {
    die("致命的エラー：不正な処理データが送信されましたので強制終了します！<br>{$cate}");
}

#---------------------------------------------------------------
# $_POST["action"]の内容で処理を分岐
#---------------------------------------------------------------
switch ($_POST["action"]) {
    case "del_data":
    ////////////////////////////////////////////////////////////////
    // 該当カテゴリーの削除


        $chkSql = "SELECT RES_ID FROM ".COLUMN_PRODUCT_LST." WHERE (DEL_FLG = '0') AND (CATEGORY_CODE = '$cate') LIMIT 0,1";
        if ($fetch = $PDO->fetch($chkSql)) {
            die('記事の存在するカテゴリーは削除できません、削除前に他のカテゴリーへの変更移動をお願い致します。');
        }

        //DEL_FLGで表示を行わないようにする場合（カテゴリーのデータを復元できるように）
        $PDO -> regist("UPDATE ".COLUMN_CATEGORY_MST." SET DEL_FLG = '1' WHERE(CATEGORY_CODE = '$cate')");
        break;

    case "display_change":
    ////////////////////////////////////////////////////////////////
    // 表示/非表示の切替（フラグを更新）

        // 表示／非表示のデータ調整
        $up_display = ($display_change == "t")?1:0;

        // SQLを実行
        $PDO -> regist("UPDATE ".COLUMN_CATEGORY_MST." SET DISPLAY_FLG = '$up_display' WHERE(CATEGORY_CODE = '$cate')");

}
