<?php
/*******************************************************************************
更新プログラム

	Logic:削除処理  ※完全にデータを削除します。(DELETE文)

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if( !$_SERVER['PHP_AUTH_USER'] || !$_SERVER['PHP_AUTH_PW'] ){
	header("HTTP/1.0 404 Not Found"); exit();
}
// 不正アクセスチェック（直接このファイルにアクセスした場合）
if(!$injustice_access_chk){
	header("HTTP/1.0 404 Not Found");exit();
}

#================================================================================
# データ削除
#================================================================================
// POST受信値を確認後に削除処理に入る
if( $_POST["status"] == "del_data" ):

// 削除対象IDデータのチェック
if(empty($diary_id)){die("致命的エラー：不正な処理データが送信されましたので強制終了します！");}

#================================================================================
#	画像ファイルを削除
#================================================================================

	if(file_exists(N6_1IMG_PATH."/{$diary_id}.jpg")):
		unlink(N6_1IMG_PATH."{$diary_id}.jpg") or die("画像の削除に失敗しました。");
	endif;

	/////////////////////////////////////
	// 該当データの完全削除用SQL組立て
	$del_sql = "
	DELETE FROM
		N6_1DIARY
	WHERE
		(DIARY_ID = '$diary_id')
	";
	// ＳＱＬを実行（失敗時：エラーメッセージを格納）
	$upResult = dbOpe::regist($del_sql,DB_USER,DB_PASS,DB_NAME,DB_SERVER);
	if($upResult)die("データ削除に失敗しました");

endif;
?>