<?php
/*******************************************************************************
PICKUP更新プログラム
	メインコントローラー

*******************************************************************************/

#---------------------------------------------------------------
# 不正アクセスチェック（直接このファイルにアクセスした場合）
#	※厳しく行う場合はIDとPWも一致するかまで行う
#---------------------------------------------------------------
if( !$_SERVER['PHP_AUTH_USER'] || !$_SERVER['PHP_AUTH_PW'] ){
	header("HTTP/1.0 404 Not Found"); exit();
}

// 不正アクセスチェックのフラグ
$injustice_access_chk = 1;

// 設定ファイル＆共通ライブラリの読み込み
require_once("../../common/config_S14.php");		// 共通設定情報
require_once("dbOpe.php");						// ＤＢ操作クラスライブラリ
require_once("util_lib.php");					// 汎用処理クラスライブラリ
require_once('imgOpe.php');						// 画像アップロードクラスライブラリ

#===============================================================================
# $_POST["action"]の内容により処理を分岐
#===============================================================================
$img = S14_IMG_PATH."top.jpg";//PICKUPのイメージパス

switch($_POST["status"]):
case "edit":
	include("LGC_edit.php");
break;
	default:
	include("DISP_input.php");
endswitch;
// デバッグ用
//print_r($_POST);
?>