<?php
/*******************************************************************************
SiteWiN 10 20 30（MySQL版）
設定ファイルの定義

*******************************************************************************/

// 設定ファイル＆共通ライブラリの読み込み
require_once("config.php");	// 共通設定情報

#=================================================================================
# 管理画面に共通して表示させる値
#=================================================================================
define('S2_TITLE','商品紹介の更新');	// Sx系（商品紹介）のタイトル

#=================================================================================
# 最大登録件数の指定
#=================================================================================
define('S2_DBMAX_CNT',50);	// Sx系（商品紹介）の最大登録件数

#=================================================================================
# 最大表示件数の指定
#=================================================================================
define('S2_DISP_MAXROW',9);	// Sx系（商品紹介）の 1ページの最大表示件数

define('DISP_MAXROW_BACK',9);	// 管理画面での1ページの最大表示件数

// 1行の列数※クロス表示でない場合は１を設定
define('LINE_MAXCOL',3);

#=================================================================================
# データベースでのテーブル名の指定
#=================================================================================
define('S2_PRODUCT_LST','S2_PRODUCT_LST');	//登録データ

#=================================================================================
# 表画面のフォルダの指定(管理画面のみで使用・プレビュー用)
#=================================================================================
define('PREV_PATH','../../S2/');

#=================================================================================
# 画像情報の指定
#=================================================================================
// 画像ファイルパス（管理画面のみで使用）
define('S2_IMG_PATH','../../S2/up_img/');

// 画像枚数
define('IMG_CNT',1);

// アップロードサイズ上限(MB)
define('MAX_MB',2);

// 画像ファイルサイズ
define('S2_IMGSIZE_SX',40);	// 管理画面サムネイル用
define('S2_IMGSIZE_SY',30);	// 管理画面サムネイル用
define('S2_IMGSIZE_MX1',190);	// アップロード画像幅（高自動算出）
define('S2_IMGSIZE_MY1',150);	// アップロード画像高（幅自動算出）

//定数を配列に格納しておく（back_officeのLGC_regist.phpで使用）
$ox = array(S2_IMGSIZE_MX1);
$oy = array(S2_IMGSIZE_MY1);

#=================================================================================
# 管理画面のデータ並び替えのタイプ
# 1 新しいタイプの並び替えPG
# 0 古いタイプの並び替えPG
#=================================================================================
define('S2_SORT_TYPE','1');	// Sx系（商品紹介）のタイトル

?>